# IdeaStatiCa.RcsApi.Model.BoltAssembly
Bolt assembly

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Name** | **string** | Name of bolt assembly | [optional]
**BoltGrade** | **ReferenceElement** |  | [optional]
**Diameter** | **double** | Bolt diameter | [optional]
**Borehole** | **double** | Size of bore Hole | [optional]
**HeadDiameter** | **double** | Diameter of the head | [optional]
**DiagonalHeadDiameter** | **double** | Second diameter of the head | [optional]
**HeadHeight** | **double** | Thickness of head | [optional]
**GrossArea** | **double** | Gross cross-section area | [optional]
**TensileStressArea** | **double** | Tensile stress area | [optional]
**NutThickness** | **double** | Thickness of Nut | [optional]
**WasherThickness** | **double** | Thickness of washer | [optional]
**WasherAtHead** | **bool** | Washer at head side of bolt assembly | [optional]
**WasherAtNut** | **bool** | Is washer at Nut side of bolt assembly | [optional]
**LoadFromLibrary** | **bool** | Load from library - try override properties from library find BoltAssembly by name | [optional]
**Id** | **int** | Element Id | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)